Repository: CofficLab/Lumi
Catalog: Packages/OpenInKit/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Open the current project or any specified path in %@
zh_hans: 在 %@ 中打开当前项目或指定路径

source: External App
zh_hans: 外部应用

source: Agent Tool
zh_hans: Agent 工具

source: Agent tool
zh_hans: Agent 工具

source: Permission risk
zh_hans: 权限风险

source: Low
zh_hans: 低

source: A direct handoff to %@
zh_hans: 直接交接到 %@

source: Keep the project in Lumi while sending the current project or a specific absolute path to the external application.
zh_hans: 将当前项目或指定绝对路径发送到外部应用，同时在 Lumi 中保留项目。

source: Core Capabilities
zh_hans: 核心能力

source: Current Project
zh_hans: 当前项目

source: Uses the open project as the default target when no path is supplied.
zh_hans: 未提供路径时，默认使用当前打开的项目。

source: Explicit Paths
zh_hans: 指定路径

source: Accepts an absolute path when you need to open a different project or folder.
zh_hans: 需要打开其他项目或文件夹时，可接受绝对路径。

source: Low-Risk Action
zh_hans: 低风险操作

source: Only asks the operating system to open the target in %@.
zh_hans: 仅请求操作系统在 %@ 中打开目标。

source: How It Works
zh_hans: 工作原理

source: Choose a target
zh_hans: 选择目标

source: Ask the Agent to open the current project, or provide an absolute path.
zh_hans: 让 Agent 打开当前项目，或提供绝对路径。

source: Resolve the application
zh_hans: 解析应用

source: The plugin finds the installed %@ app and uses its standard open action.
zh_hans: 插件会查找已安装的 %@ 应用并使用其标准打开操作。

source: Continue in context
zh_hans: 在上下文中继续

source: The selected project or path opens directly in %@.
zh_hans: 选中的项目或路径将直接在 %@ 中打开。

source: Open In %@
zh_hans: 在 %@ 中打开

source: User Manual
zh_hans: 用户手册

source: Overview
zh_hans: 概述

source: This manual covers the Open In %@ plugin, which opens the current project or a specified path in %@.
zh_hans: 本手册介绍 Open In %@ 插件，它可在 %@ 中打开当前项目或指定路径。

source: Tool name: `%@` — invoke this tool in the chat to open a project.
zh_hans: 工具名称：`%@` — 在聊天中调用此工具打开项目。

source: Default target: the current project in Lumi.
zh_hans: 默认目标：Lumi 中的当前项目。

source: Optional argument: an absolute path to open a different project or folder.
zh_hans: 可选参数：用于打开其他项目或文件夹的绝对路径。

source: Basic Operations
zh_hans: 基本操作

source: Ask the AI to open the current project in %@.
zh_hans: 让 AI 在 %@ 中打开当前项目。

source: Optionally provide a specific path to open a different folder.
zh_hans: 可选：提供特定路径以打开其他文件夹。

source: The plugin resolves the %@ application and sends the open command.
zh_hans: 插件会解析 %@ 应用并发送打开命令。

source: The project opens directly in %@.
zh_hans: 项目将直接在 %@ 中打开。

source: Notes
zh_hans: 注意事项

source: %@ must be installed on your Mac for this plugin to work.
zh_hans: 此插件需要您的 Mac 上已安装 %@。

source: This is a low-risk action — it only asks the OS to open the target in %@.
zh_hans: 这是一个低风险操作 — 仅请求操作系统在 %@ 中打开目标。
